server/tags/1.7.17/sql/testdata/soapxml/changeOrganizationData_v1.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:dhl="http://producers.dhl.xtee.riik.ee/producer/dhl"
  xmlns:xtee="http://x-tee.riik.ee/xsd/xtee.xsd">  
	<env:Header>
		<xtee:asutus>70006317</xtee:asutus>
		<xtee:andmekogu>dhl</xtee:andmekogu>
		<xtee:ametnik>12345678901</xtee:ametnik>
		<xtee:nimi>dhl.changeOrganizationData.v1</xtee:nimi>
		<xtee:id>dhl_client_1</xtee:id>
		<xtee:toimik/>
		<xtee:isikukood>EE38806190294</xtee:isikukood>
	</env:Header>
	<env:Body>
		<dhl:changeOrganizationData>
			<keha>
				<registrikood>70006317</registrikood>
				<endine_registrikood>70006317</endine_registrikood>
				<korgemalseisva_asutuse_registrikood>70006317</korgemalseisva_asutuse_registrikood>
				<nimi>Asutus AS</nimi>
				<nime_lyhend>AAS</nime_lyhend>
				<liik1>L1</liik1>
				<liik2>L2</liik2>
				<tegevusala>Kaubandus</tegevusala>
				<tegevuspiirkond>Tallinn</tegevuspiirkond>
				<maakond>Harjumaa</maakond>
				<asukoht>Tallinn</asukoht>
				<aadress>Akadeemia tee 21</aadress>
				<postikood>12618</postikood>
				<telefon>6543210</telefon>
				<faks>6543211</faks>
				<e_post>info@asutus.ee</e_post>
				<www>http://www.asutus.ee</www>
				<logo/>
				<asutamise_kuupaev>2008-01-11</asutamise_kuupaev>
				<moodustamise_akti_nimi>Moodustamise akt</moodustamise_akti_nimi>
				<moodustamise_akti_number>1A2</moodustamise_akti_number>
				<moodustamise_akti_kuupaev>2008-02-01</moodustamise_akti_kuupaev>
				<pohimaaruse_akti_nimi>Põhimäärus</pohimaaruse_akti_nimi>
				<pohimaaruse_akti_number>2A3</pohimaaruse_akti_number>
				<pohimaaruse_kinnitamise_kuupaev>2008-03-01 </pohimaaruse_kinnitamise_kuupaev>
				<pohimaaruse_kande_kuupaev>2008-03-05</pohimaaruse_kande_kuupaev>
				<parameetrid>Parameetrid 123</parameetrid>
				<dvk_saatmine>1</dvk_saatmine>
				<dvk_otse_saatmine>0</dvk_otse_saatmine>
				<toetatav_dvk_versioon>1.5</toetatav_dvk_versioon>
				<dokumendihaldussysteemi_nimetus>SuperDoc 2000 </dokumendihaldussysteemi_nimetus>
			</keha>
		</dhl:changeOrganizationData>
	</env:Body>
</env:Envelope>
